export default {
  name: "顾成焕",
  tel: "18327863706",
  email: "m18327863706_1@163.com ",
  ages: 6,
  github: "https://github.com/guchenghuan",
  website: "http://guchenghuan.com/",
  juejin: "https://juejin.cn/user/2647279731480477/posts",
  edus: [
    {
      left: "湖北理工",
      right: "本科",
      children: [
        {
          left: "专业：环境工程",
          right: "2014年09月 - 2018年06月",
        },
      ],
    },
  ],
  advance: [
    "任职过测试、测试开发、前端开发",
    "参加Hackathon技术大赛，三等奖",
    "多次获得公司荣誉，如：优秀技术贡献奖、优秀员工奖、优秀团队项目奖等",
    "主导组内技术学习与实践，积极参加公司内部技术分享，积极学习前沿技术，并在组内推广、使用",
    "工作认真负责，积极完成工作，注重团队效率，绩效考核均是高绩效",
  ],
  skills: {
    techs: [
      "React.js",
      "Vue.js",
      "HTML5",
      "JavaScript",
      "TypeScript",
      "ES6",
      "CSS3",
      "SCSS",
      "Node.js",
      "MongoDB",
      "Docker",
      "JAVA",
      "Webpack",
      "Linux",
    ],
    tests: [
      "Cypress",
      "Jest",
      "selenium",
      "puppeteer",
      "koa",
      "Apifox",
      "Charles",
      "UiAutomator2",
      "tidevice",
    ],
  },
  works: [
    {
      left: "小红书 @质量平台",
      link: "",
      right: "2022年09月 - 至今",
      children: [
        {
          left: "主要职责1：",
          children: [
            {
              left: "负责14个工具平台前端相关开发工作，包含但不限于：压测、流量回放、云真机等",
            },
          ],
        },
        {
          left: "工作：",
          children: [
            {
              left: "带组内2位前端同学，完成总计200+个业务需求的前端开发工作",
            },
            {
              left: "针对每个平台的核心页面进行重新设计、性能优化，提升稳定性及用户体验",
            },
            {
              left: "解决业务/框架/服务部署等方向上的疑难杂症（例如：pipeline流水线打包、服务部署发布、服务代理Nginx、Vue2->Vue3升级、npm->pnpm升级等）",
            },
            {
              left: "使用到的技术栈 *React , Vue3 , Vue2 , Redux , TypeScript , Pinia*等 , 使用到的组件、UI库 *Ant Design , Element-Plus , Echarts*",
            },
          ],
        },
        {
          left: "业绩：",
          children: [
            {
              left: "需求快速迭代，交付质量较优。为各平台在业务测试环节中的测试辅助能力提供稳定、高效的保障",
            },
            {
              left: "通过改进打包方式、简化代码结构、页面抽离组件、根据浏览器加载原理改变依赖文件加载方式和时机等优化方式对各平台逐个优化。保证核心页面无卡顿/崩溃。提升用户的使用体验和使用效率",
            },
            {
              left: "对组内两位前端同学的培养，使其能独立承接各个工具平台的前端开发工作",
            },
          ],
        },
        {
          left: "主要职责2：",
          children: [
            {
              left: "负责数据构造、用例管理、账号管理三个平台从0-1建设，推广和维护工作",
            },
          ],
        },
        {
          left: "工作：",
          children: [
            {
              left: "带组内2位工具开发同学，完成数据工厂、用例管理的重构；账号管理平台的从0-1的设计开发，使用推广",
            },
            {
              left: "数据工厂：实现Http/RPC/mysql/redis等底层原子能力，配置化造数的方式，实现测试数据的构造/查询；实现平台租户模式：作为数据中台能力，针对不同业务线各自定制其数据需求；实现统一对外OpenAPI，为业务测试/自动化测试提供一键构造测试数据能力，且造数能力支持sit/beta一键切换",
            },
            {
              left: "用例平台：打造了一个从业务方需求提出后，测试用例编写/评审，研发冒烟自测，测试用例执行，测试日报推送，回归用例审核，回归计划执行等一系列测试流程管理的平台；实现与埋点测试平台的打通，统一测试执行流程；实现与数据工厂的打通，测试过程中一键造数；实现测试用例脚本化（关联云测UI自动化/接口自动化等）",
            },
            {
              left: "账号管理：统一管理了公司测试账号；实现测试账号动态登录/账号属性注入等",
            },
            {
              left: "使用到的技术栈 *JAVA , Spring Boot , Vue3 , Redux , TypeScript , Mysql , Redis*等 ",
            },
          ],
        },
        {
          left: "业绩：",
          children: [
            {
              left: "数据工厂 - 高效提升数据查询和数据构造的效率。构造方式效率提升 99.76% ，维护成本降低 98.61% ；总计调用量 *10W+* ，成功率 99.96% ；平台增长用户总数 *315* （研发占比近： 38% ）；沉淀构造千万级测试账号的能力",
            },
            {
              left: "用例管理 - 平台整体操作使用性能提升 74.5% 高效提升用户的使用效率。录入用例集 *2326* 个，用例 *11W+* ，测试计划 *1552* 个，测试报告 *544* 个，总计使用用户 *491* （研发占比近： 41% ）；可自动化case占比 36% ；业务测试流程可追溯，可度量",
            },
            {
              left: "账号管理 - 统一管理了测试账号，方便测试过程中查找与使用；使用测试账号期间，解决了账号互踢的情况；针对需要使用任何可支持的属性的测试账号，通过数据工厂提供的OpenAPI一键实现",
            },
          ],
        },
      ],
    },
    {
      left: "bilibili @光呆项目部",
      link: "",
      right: "2022年04月 - 2022年09月",
      children: [
        {
          left: "主要职责：",
          children: [
            {
              left: "UNXApp的开发，管理后台的开发",
            },
          ],
        },
        {
          left: "工作：",
          children: [
            {
              left: "使用 *React + Redux + Ant Design* 技术栈开发管理后台",
            },
            {
              left: "使用 *React + Redux* 技术栈开发潮玩App中的H5页面，同时使用 *node.js* 实现 *SSR* 渲染",
            },
            {
              left: "期间转去 *DoDo* 社区，主要职责：调研了解 *single-spa* 和 *qiankun* ，使用 *qiankun* 管理老项目和新项目",
            },
            {
              left: "后期参与 *web3* 方向的研究和学习。主要是区块链技术",
            },
          ],
        },

        {
          left: "业绩：",
          children: [
            {
              left: "UNXApp从0-1的开发上线，日活用户10w+ 、使用qiankun管理DoDo的新老项目，高效迭代",
            },
          ],
        },
      ],
    },
    {
      left: "bilibili @主站技术中心",
      link: "",
      right: "2020年04月 - 2022年04月",
      children: [
        {
          left: "主要职责：",
          children: [
            {
              left: "开发测试脚本、工具平台、Chrome插件",
            },
          ],
        },
        {
          left: "工作：",
          children: [
            {
              left: "测试脚本包括：项目提测后的一键冒烟测试、线上日志报错告警、线上页面崩溃/白屏告警、DomDiff回归测试等",
            },
            {
              left: "工具平台包括：web页面性能、web播放器性能、js覆盖率、播放器用例自动化等",
            },
            {
              left: "使用到的技术栈 *Vue3 、 TypeScript 、nodeJs 、Koa 、MongoDB *",
            },
            {
              left: "使用到的组件、UI库 *Element-Plus , Echarts*",
            },
            {
              left: "使用到的测试库 *Puppeteer*",
            },
          ],
        },

        {
          left: "业绩：",
          children: [
            {
              left: "前端方向测试工具从0-1建设，提升了前端测试效率，丰富了前端测试手段",
            },
            {
              left: "测试脚本有效提升了测试回归效率，节省人力成本 30%+",
            },
            {
              left: "Js覆盖率弥补了测试过程中的测试点遗漏，同时也提升了测试同学对于前端代码的阅读和走查能力",
            },
            {
              left: "性能检测监控使页面性能整体提升20%+、播放器性能整体提升30%+",
            },
            {
              left: "播放器用例回归自动化释放了一半的人力，效能提升了50%",
            },
          ],
        },
      ],
    },
    {
      left: "携程 @金服",
      link: "",
      right: "2018年06月 - 2020年04月",
      children: [
        {
          left: "主要职责：购物相关的测试工作和测试脚本的编写",
        },
      ],
    },
  ],
};
